ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_memss_c_config_regs.xml
<module id="MEMSS_C_CONFIG_REGS" HW_revision="" description="MEMSS C CONFIG Registers">
	<register id="CPA0_MEM_CONFIG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPA0 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LPA0 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CPA0 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CPA0_MEM_CONFIG_LOCK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Temporary Lock for CPA0 Memory Configuration Register ">
		<bitfield id="CPA0_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPA0_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Permament Lock for CPA0 Memory Configuration Register ">
		<bitfield id="CPA0_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPA1_MEM_CONFIG" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="CPA1 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LPA1 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CPA1 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CPA1_MEM_CONFIG_LOCK" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Temporary Lock for CPA1 Memory Configuration Register ">
		<bitfield id="CPA1_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPA1_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Permament Lock for CPA1 Memory Configuration Register ">
		<bitfield id="CPA1_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA0_MEM_CONFIG" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="CDA0 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA0 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA0 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA0_MEM_CONFIG_LOCK" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA0 Memory Configuration Register ">
		<bitfield id="CDA0_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA0_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA0 Memory Configuration Register ">
		<bitfield id="CDA0_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA1_MEM_CONFIG" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="CDA1 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA1 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA1 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA1_MEM_CONFIG_LOCK" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA1 Memory Configuration Register ">
		<bitfield id="CDA1_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA1_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA1 Memory Configuration Register ">
		<bitfield id="CDA1_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA2_MEM_CONFIG" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="CDA2 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA2 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA2 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA2_MEM_CONFIG_LOCK" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA2 Memory Configuration Register ">
		<bitfield id="CDA2_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA2_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA2 Memory Configuration Register ">
		<bitfield id="CDA2_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA3_MEM_CONFIG" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="CDA3 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA3 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA3 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA3_MEM_CONFIG_LOCK" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA3 Memory Configuration Register ">
		<bitfield id="CDA3_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA3_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA3 Memory Configuration Register ">
		<bitfield id="CDA3_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA4_MEM_CONFIG" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="CDA4 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA4 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA4 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA4_MEM_CONFIG_LOCK" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA4 Memory Configuration Register ">
		<bitfield id="CDA4_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA4_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA4 Memory Configuration Register ">
		<bitfield id="CDA4_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA5_MEM_CONFIG" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="CDA5 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA5 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA5 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA5_MEM_CONFIG_LOCK" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA5 Memory Configuration Register ">
		<bitfield id="CDA5_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA5_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA5 Memory Configuration Register ">
		<bitfield id="CDA5_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA6_MEM_CONFIG" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="CDA6 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA6 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA6 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA6_MEM_CONFIG_LOCK" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA6 Memory Configuration Register ">
		<bitfield id="CDA6_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA6_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA6 Memory Configuration Register ">
		<bitfield id="CDA6_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA7_MEM_CONFIG" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="CDA7 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA7 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA7 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA7_MEM_CONFIG_LOCK" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA7 Memory Configuration Register ">
		<bitfield id="CDA7_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA7_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA7 Memory Configuration Register ">
		<bitfield id="CDA7_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA8_MEM_CONFIG" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="CDA8 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA8 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA8 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA8_MEM_CONFIG_LOCK" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA8 Memory Configuration Register ">
		<bitfield id="CDA8_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA8_MEM_CONFIG_COMMIT" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA8 Memory Configuration Register ">
		<bitfield id="CDA8_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA9_MEM_CONFIG" width="32" page="0" offset="0xb0" instances="1" instaddr="4" internal="0" description="CDA9 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA9 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA9 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA9_MEM_CONFIG_LOCK" width="32" page="0" offset="0xb4" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA9 Memory Configuration Register ">
		<bitfield id="CDA9_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA9_MEM_CONFIG_COMMIT" width="32" page="0" offset="0xb8" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA9 Memory Configuration Register ">
		<bitfield id="CDA9_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA10_MEM_CONFIG" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="CDA10 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA10 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA10 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA10_MEM_CONFIG_LOCK" width="32" page="0" offset="0xc4" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA10 Memory Configuration Register ">
		<bitfield id="CDA10_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA10_MEM_CONFIG_COMMIT" width="32" page="0" offset="0xc8" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA10 Memory Configuration Register ">
		<bitfield id="CDA10_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA11_MEM_CONFIG" width="32" page="0" offset="0xd0" instances="1" instaddr="4" internal="0" description="CDA11 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA11 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="CDA11 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="CDA11_MEM_CONFIG_LOCK" width="32" page="0" offset="0xd4" instances="1" instaddr="4" internal="0" description="Temporary Lock for CDA11 Memory Configuration Register ">
		<bitfield id="CDA11_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CDA11_MEM_CONFIG_COMMIT" width="32" page="0" offset="0xd8" instances="1" instaddr="4" internal="0" description="Permament Lock for CDA11 Memory Configuration Register ">
		<bitfield id="CDA11_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
